Revit 2027 API
Rebar.GetBendData Method
 Gets the RebarBendData, containing bar and hook information, of the instance.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public RebarBendData GetBendData()
Public Function GetBendData As RebarBendData
public:
RebarBendData^ GetBendData()
member GetBendData : unit -> RebarBendData
Return Value
RebarBendData
Remarks
 Internally, the bend data is used by many RebarShape methods to generate shape geometry.
See Also
Reference
Rebar Class
Autodesk.Revit.DB.Structure Namespace